Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/tax/tax_credits_and_reliefs_for_people_with_disabilities/incapacitated_child_tax_credit.html.txt.tmx
Source language: en
Languages: ga

source: Incapacitated Child Tax Credit
ga: Creidmheas Cánach do Pháiste le hÉagumas

source: You can claim an Incapacitated Child Tax Credit if you are the parent or guardian of a child who is permanently incapacitated, either physically or mentally and
ga: Is féidir le tuismitheoir/coimirceoir páiste a bhfuil éagumas buan air/uirthi, bíodh sé fisiciúil nó intleachtúil, an Creidmheas Cánach do Pháiste le hÉagumas a éileamh:

source: • Became so before reaching 21 years of age or
ga: • Má bhí an t-éagumas ar an bpáiste roimh dó/dí 21 bliain d'aois a bhaint amach nó

source: • Becomes permanently incapacitated after reaching the age of 21, but while still in full-time education or while training for a trade or profession for a minimum of 2 years
ga: • Má thagann an t-éagumas buan air/uirthi tar éis dó/dí 21 bliain d'aois a bhaint amach ach é/í a bheith fós ag freastal ar oideachas lánaimseartha nó ag traenáil do cheird nó do ghairm ar feadh dhá bhliana ar a laghad

source: You can also claim the credit for:
ga: Is féidir an creidmheas a éileamh ar son na ndaoine seo a leanas freisin:

source: • Any child of whom you have custody, who is maintained at your own expense and who is permanently incapacitated You can claim a credit for more than one child where more than one child is permanently incapacitated
ga: • Aon pháiste atá faoi chúram an éilitheora, atá dhá chothú ag an éilitheoir as a p(h)óca féin agus a bhfuil éagumas buan air/uirthi

source: Where the child is maintained by one parent only, that parent is entitled to claim the full amount of the tax credit
ga: Is féidir creidmheas a éileamh ar son gach páiste ann féin má tá níos mó ná páiste amháin i gceist le héagumas

source: Disabilities regarded as permanently incapacitating are:
ga: Seo a leanas samplaí de mhíchumais a luaitear mar ghalair éagumasacha buana :

source: • Certain forms of schizophrenia
ga: • Cineálacha faoi leith den ghalar Scitsifréine

source: This is not an exhaustive list
ga: Is féidir cur leis an liosta seo

source: A credit is not due where the child is fully maintained at public or charitable expense
ga: Ní féidir creidmheas a éileamh má tá páiste cothaithe go hiomlán ag foinse phoiblí nó charthanachta

source: You may also claim tax relief for medical expenses incurred by yourself or any other person
ga: Is féidir leat freisin éileamh a dhéanamh ar fhaoiseamh cánach ar son costas leighis a thiteann ort féin nó ar éinne eile

source: In 2017, the Incapacitated Child Tax Credit is €3,300
ga: Don bhliain 2017, tugtar creidmheas cánach de €3,300

source: You use this claim form (pdf) to claim the Incapacitated Child Tax Credit. You can also claim the credit through PAYE Anytime which is available through Revenue's myAccount service
ga: Ba cheart glaoch ar nó buaileadh isteach chuig an oifig chánach áitiúil ag cur síos ar an gcreidmheas go dteastaíonn uait a éileamh agus ainm(neacha) an pháiste/na bpáistí a thabhairt

source: In some cases (where it is not obvious that the child’s incapacity is of a serious and permanent nature) you need to submit a doctor’s certificate with your initial claim
ga: Ba cheart go mbeadh teastas dochtúra in éineacht le héileamh atá dhá dhéanamh don chéad uair a thaispeánann:

source: • The date the incapacity first arose
ga: • An dáta ar tháinig an t-éagumas chun solais don chéad uair

source: • If it is a disability other than one of those listed above, whether the incapacity permanently prevents the child from maintaining his or herself
ga: • Muna bhfuil an míchumas atá ar an bpáiste luaite thuas ní mór go mbeadh sé soiléar ar theastas an dochtúra nach féidir leis an bpáiste é/í féin a chothú go buan mar gheall ar an éagumas

source: Visit the Revenue contact locator webpage to find the Lo-call number for your region or the main contact details page
ga: Tabhair cuairt ar aimsitheoir teagmhála na gCoimisinéirí Ioncaim chun an uimhir Ló-ghlao a fháil nó faigh mionsonraí teagmhála

source: You can read more about the Incapacitated Child Tax Credit in Revenue's leaflet (pdf)
ga: Léigh tuilleadh faoin Creidmheas Cánach do Pháiste le hÉagumas sa bhileog (pdf) ar revenue.ie
